jekyll/_posts/2016-06-06-specter.html
---
layout: post
title: Specter
excerpt: Lide com estruturas de dados aninhadas sem perder a sanidade.
date: 2016-06-06 20:36:30
categories: clojure data structure library immutability
---

<p>
<a href="https://github.com/nathanmarz/specter">Specter</a> é uma biblioteca que trás uma maneira diferente de trabalhar com
estruturas de dados aninhadas em Clojure. Ela faz uso dos chamados <span class="underline">paths</span> para
fazer fazer transformações e consultas.
</p>

<p>
Essa proposta é muito interessante para deixar a tentação de recorrer à
mutabilidate por ser mais fácil de se alterar um subset da estrutura, porque como
Rich Hickey já nos ensinou, <a href="https://www.infoq.com/presentations/Simple-Made-Easy">fácil não quer dizer simples</a>.
</p>

<p>
A principal vantagem dos <span class="underline">paths</span> é que eles podem ser combinados com outros para
expressar regras mais complexas mantendo a função de transformação intácta.
</p>

<p>
Considere que temos uma lista de maps que representam pessoas, e nesses maps,
temos as keys <code>:name</code> identificando os nomes e <code>:age</code> as idades. Diante deste
cenário, queremos incrementar as idades de todo mundo em um.
</p>

<p>
Para atingir este objetivo, usariamos a função core do clojure <code>update</code> em
conjunto com <code>map</code> para executar essa transformação.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>map #<span style="color: #bc6ec5;">(</span>update <span style="color: #7590db;">%</span> <span style="color: #a45bad;">:age</span> inc<span style="color: #bc6ec5;">)</span>
     <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Carlos"</span>
       <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">31</span><span style="color: #2d9574;">}</span>
      <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Julia"</span>
       <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">25</span><span style="color: #2d9574;">}</span>
      <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Katia"</span>
       <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">69</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; ({</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Carlos", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 32} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Julia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 26} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Katia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 70})</span>
</pre>
</div>

<p>
Em comparação, com Specter:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>require '<span style="color: #bc6ec5;">[</span><span style="color: #ce537a; font-weight: bold;">com.rpl.specter</span> <span style="color: #a45bad;">:refer</span> <span style="color: #2d9574;">[</span>transform <span style="color: #a45bad;">ALL</span> comp-paths<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span>transform <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">ALL</span> <span style="color: #a45bad;">:age</span><span style="color: #bc6ec5;">]</span>
           inc
           <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Carlos"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">31</span><span style="color: #2d9574;">}</span>
            <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Julia"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">25</span><span style="color: #2d9574;">}</span>
            <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Katia"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">69</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [{</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Carlos", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 32} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Julia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 26} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Katia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 70}]</span>
</pre>
</div>

<p>
Primeiro começamos fazendo <code>require</code> no namespace principal do Specter, com um
refer das vars <code>transform=e =ALL</code> para o nosso namespace atual. A primeira var
importada é uma função <code>transform</code> que recebe três argumentos, um vetor de
<span class="underline">paths</span>, uma função para aplicar nos nós achados pelos <span class="underline">paths</span> e por final, a
estrutura de dados a ser modificada.
</p>

<p>
Vamos nos concentrar no primeiro argumento da função, o que <code>[ALL :age]</code> quer
dizer?
</p>

<p>
<code>ALL</code> é um <span class="underline">path</span> padrão do Specter, com ele queremos dizer que estamos
interessados em todos os itens de uma coleção, o próximo <span class="underline">path</span> na lista é o
<code>:age</code> que não é nada mais, nada menos que uma <span class="underline">keyword</span>, que são tratadas como
funções quando usadas em maps, então se juntarmos esses dois elementos, estamos
dizendo ao Specter que queremos aplicar a função <code>inc</code> em todos os valores de
<code>:age</code> em cada elemento de uma coleção.
</p>

<p>
Se analisarmos o exemplo acima, podemos não enxergar muita vantagem na última
abordagem, afinal de contas, usando Specter, nós escrevemos mais linhas de
código, sem falar na dependência extra. Mas quando separamos a transformação das
regras de estrutura, abrimos espaço para composição, tnato de <span class="underline">paths</span> quanto de
funções.
</p>

<p>
Vamos aplicar isso em mais um exemplo, imagine que nessa mesma estrutura que
estamos utilizando, nós precisemos incrementar a idade apenas das pessoas que
tenham mais de 60 anos. O resultado seria:
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #4f97d7;">(</span>transform <span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">ALL</span> <span style="color: #a45bad;">:age</span> #<span style="color: #2d9574;">(</span>&gt; <span style="color: #7590db;">%</span> <span style="color: #a45bad;">60</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
           inc
           <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Carlos"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">31</span><span style="color: #2d9574;">}</span>
            <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Julia"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">25</span><span style="color: #2d9574;">}</span>
            <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Katia"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">69</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [{</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Carlos", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 31} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Julia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 25} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Katia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 70}]</span>
</pre>
</div>

<p>
A função de transformação continua a mesma, a estrutura continua a mesma, mas
com apenas uma pequena função anônima no final do vetor de <span class="underline">paths</span> nós mudamos
completamente o comportamento do nosso código, atingindo o resultado esperado
sem muitas mudanças.
</p>

<p>
E o melhor de tudo, podemos compor esses <span class="underline">paths</span> e dar nome as nossas abstrações.
</p>

<div class="org-src-container">

<pre class="src src-clojure"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #7590db;">WITH-AGES-GREATER-THAN-60</span> <span style="color: #bc6ec5;">(</span>comp-paths <span style="color: #a45bad;">ALL</span> <span style="color: #a45bad;">:age</span> #<span style="color: #2d9574;">(</span>&gt; <span style="color: #7590db;">%</span> <span style="color: #a45bad;">60</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>transform <span style="color: #bc6ec5;">[</span>WITH-AGES-GREATER-THAN-60<span style="color: #bc6ec5;">]</span>
           inc
           <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Carlos"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">31</span><span style="color: #2d9574;">}</span>
            <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Julia"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">25</span><span style="color: #2d9574;">}</span>
            <span style="color: #2d9574;">{</span><span style="color: #a45bad;">:name</span> <span style="color: #2d9574;">"Katia"</span>
             <span style="color: #a45bad;">:age</span> <span style="color: #a45bad;">69</span><span style="color: #2d9574;">}</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">=&gt; [{</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Carlos", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 31} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Julia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 25} {</span><span style="color: #2aa1ae; background-color: #292e34;">:name</span><span style="color: #2aa1ae; background-color: #292e34;"> "Katia", </span><span style="color: #2aa1ae; background-color: #292e34;">:age</span><span style="color: #2aa1ae; background-color: #292e34;"> 70}]</span>
</pre>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Conclusão</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
Specter é uma bibliotéca que te faz repensar o jeito de escrever código, as
ferramentas que são colocadas à mesa são muito poderosas e podem te livrar de
muita dor de cabeça. Obviamente, só toquei na ponta do iceberg com esse post. só
expondo a funcionalidade de transformação e não aprofundando muito em tudo que
pode ser feito com os <span class="underline">paths</span>. Há também a possibilidade de se executar
consultas e setar valores em qualquer estrutura de dados.
</p>

<p>
Dito isso, indico muito a experiência de tentar Specter, simplesmente brinque
com as possibilidades no repl e faça comparações com soluções usando apenas as
funções nativas do Clojure e veja por si mesmo.
</p>
</div>
</div>
